app/Livewire/Admin/Products/ProductCreate.php

select * from `families`
---
    public function mount()
    {
        $this->families = Family::all();

select * from `categories` where `family_id` = ''
---
    public function categories()
    {
        return Category::where('family_id', $this->family_id)->get();

select * from `subcategories` where `category_id` = ''
---
    public function subcategories()
    {
        return Subcategory::where('category_id', $this->category_id)->get();

insert into `products` (`sku`, `name`, `description`, `image_path`, `price`, `subcategory_id`, `updated_at`, `created_at`) values ('1234', 'Prueba', 'Prueba 1', 'public/products/jJr6NLRH6dXFQL5sJFjsxEBJqySUQSeE1xilzv6s.jpg', '122', '4', '2024-08-05 23:48:23', '2024-08-05 23:48:23')
---
    public function store()
    {
        $this->validate([
            'product.subcategory_id' => 'required|exists:subcategories,id',
            'product.sku' => 'required|unique:products,sku',
            'product.name' => 'required|max:255',
            'product.description' => 'required',
            'product.price' => 'required|numeric|min:0',
            'image' => 'required|image|max:1024',
        ],[],[
            'family_id' => 'Famila',
            'category_id' => 'Categoria',
            'product.subcategory_id' => 'Subcategoria',
            'product.sku' => 'SKU',
            'product.name' => 'Nombre',
            'product.description' => 'Descripción',
            'product.price' => 'Precio',
        ]);

        $this->product['image_path'] = $this->image->store('public/products');

        $product =Product::create($this->product);