app/Livewire/Admin/Subcategories/SubcategoryCreate.php

    public function mount()
    {
        $this->families = Family::all();
---
select * from `families`

    public function categories()
    {
        return Category::where('family_id', $this->subcategory['family_id'])->get();
---
select * from `categories` where `family_id` = ''

    public function save()
    {
        $this->validate([
            'subcategory.family_id' => 'required',
            'subcategory.category_id' => 'required',
            'subcategory.name' => 'required',
        ],[],[
            'subcategory.family_id' => 'Familia',
            'subcategory.category_id' => 'Categoria',
            'subcategory.name' => 'Nombre',
        ]);

        Subcategory::create($this->subcategory);
---
insert into `subcategories` (`category_id`, `name`, `updated_at`, `created_at`) values ('1', 'Patalla prueba', '2024-08-05 16:27:05', '2024-08-05 16:27:05')