app/Livewire/Admin/Subcategories/SubcategoryEdit.php

select * from `families`
---
    public function mount($subcategory)
    {
        $this->families = Family::all();

select * from `categories` where `family_id` = 1
---
    public function categories()
    {
        return Category::where('family_id', $this->subcategoryEdit['family_id'])->get();

update `subcategories` set `name` = 'Patalla prueba 11', `subcategories`.`updated_at` = '2024-08-05 16:27:13' where `id` = 633
---
    public function save()
    {
        $this->validate([
            'subcategoryEdit.family_id' => 'required',
            'subcategoryEdit.category_id' => 'required',
            'subcategoryEdit.name' => 'required',
        ],[],[
            'subcategoryEdit.family_id' => 'Familia',
            'subcategoryEdit.category_id' => 'Categoria',
            'subcategoryEdit.name' => 'Nombre',
        ]);

        $this->subcategory->update($this->subcategoryEdit);