app/Http/Controllers/Admin/CategoryController.php

    public function index()
    {

        $categories = Category::orderBy('id', 'desc')
        ->with('family')
        ->paginate(10);
---
select * from `categories` order by `id` desc limit 10 offset 0
select * from `families` where `families`.`id` in (17, 18)
select count(*) as aggregate from `categories`