app/Http/Controllers/Admin/FamilyController.php

    public function index()
    {
        $families = Family::orderBy('id', 'desc')->paginate();
---
select * from `families` order by `id` desc limit 15 offset 0
select count(*) as aggregate from `families`