app/Http/Controllers/Admin/SubcategoryController.php

    public function index()
    {
        $subcategories = Subcategory::orderBy('id', 'desc')
        ->with('category')
        ->paginate(10);
---
select * from `categories` where `categories`.`id` in (121, 122, 123, 124)
select * from `subcategories` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `subcategories`

    public function destroy(Subcategory $subcategory)
    {
        if($subcategory->products->count() > 0) {
            session()->flash('swal',[
                'icon' => 'error',
                'title' => 'Error!',
                'text' => 'No se puede eliminar, cuenta con productos asoscia.'
            ]);

            return redirect()->route('admin.subcategories.edit', $subcategory);
    }
    $subcategory->delete();
---
select * from `products` where `products`.`subcategory_id` = 633 and `products`.`subcategory_id` is not null
delete from `subcategories` where `id` = 633